#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/style_gongzhitaao.css" />
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="./img/kagamine_rin.ico">
#+OPTIONS: html-style:nil
#+OPTIONS: toc:nil num:nil ^:nil
#+TITLE: Blog Home Page
#+DATE: [2021-08-03 Tue 00:16]

| [[./lispbooks/index.html][lispbooks]] |

* 目录：

#+BEGIN_SRC elisp :exports results :wrap raw
    (require 'cl-lib)
    (setq org-html-preamble nil)
    (defun yy-out-blogs ()
      (let ((dirs (directory-files "./posts")))
	(delete "." dirs)
	(delete ".." dirs)
	(cl-loop
	 for i in (reverse (cdr dirs))
	 concat (format "- [[%s][%s]]\n"
			(concat "./posts/" i "/index.html")
			i))))
    (yy-out-blogs)
#+END_SRC

#+RESULTS:
#+begin_raw
- [[./posts/emacs的macro/index.html][emacs的macro]]
- [[./posts/2021-08-20-10-decorator-pattern-decorator-advice-and-emacs-advice/index.html][2021-08-20-10-decorator-pattern-decorator-advice-and-emacs-advice]]
- [[./posts/2021-07-29-9-使用emacs作为app启动器/index.html][2021-07-29-9-使用emacs作为app启动器]]
- [[./posts/2021-07-04-8-bug-debugging-and-debugger-and-also-edebug/index.html][2021-07-04-8-bug-debugging-and-debugger-and-also-edebug]]
- [[./posts/2021-06-18-7-emacs的customization/index.html][2021-06-18-7-emacs的customization]]
- [[./posts/2021-06-11-6-什么是dsl和作为dsl的cl-loop/index.html][2021-06-11-6-什么是dsl和作为dsl的cl-loop]]
- [[./posts/2021-05-28-5-emacs的cl扩展/index.html][2021-05-28-5-emacs的cl扩展]]
- [[./posts/2021-04-17-4-关于作用域的一个小结/index.html][2021-04-17-4-关于作用域的一个小结]]
- [[./posts/2021-04-07-3-unwind-protect的unwind是什么意思/index.html][2021-04-07-3-unwind-protect的unwind是什么意思]]
- [[./posts/2021-03-27-2-借学习thunk之机看看delay-evaluation/index.html][2021-03-27-2-借学习thunk之机看看delay-evaluation]]
- [[./posts/2021-03-22-1-由(λ(x)(x x))看elisp与scheme之区别/index.html][2021-03-22-1-由(λ(x)(x x))看elisp与scheme之区别]]
- [[./posts/2021-03-21-0-我的从0开始的emacs配置/index.html][2021-03-21-0-我的从0开始的emacs配置]]
- [[./posts/2021-02-28-Win32编程基础之按钮控件/index.html][2021-02-28-Win32编程基础之按钮控件]]
- [[./posts/2021-01-25-C的字符串有哪些问题/index.html][2021-01-25-C的字符串有哪些问题]]
- [[./posts/2021-01-01-怎么写gitignore/index.html][2021-01-01-怎么写gitignore]]
- [[./posts/2020-10-04-现在我所能看到的自动化专业/index.html][2020-10-04-现在我所能看到的自动化专业]]
- [[./posts/2020-09-14-我所认识的编程与计算机/index.html][2020-09-14-我所认识的编程与计算机]]
- [[./posts/2020-09-09-Scheme的syntax-rules/index.html][2020-09-09-Scheme的syntax-rules]]
- [[./posts/2020-08-11-Scheme的callcc/index.html][2020-08-11-Scheme的callcc]]
- [[./posts/2020-07-17-Win32编程基础之资源/index.html][2020-07-17-Win32编程基础之资源]]
- [[./posts/2020-07-14-Win32编程基础之滚动条/index.html][2020-07-14-Win32编程基础之滚动条]]
- [[./posts/2020-07-14-Win32编程基础之控件/index.html][2020-07-14-Win32编程基础之控件]]
- [[./posts/2020-07-13-Win32编程基础之键盘输入/index.html][2020-07-13-Win32编程基础之键盘输入]]
- [[./posts/2020-07-11-Win32编程基础之鼠标输入/index.html][2020-07-11-Win32编程基础之鼠标输入]]
- [[./posts/2020-07-09-Windows窗口与消息：钩子/index.html][2020-07-09-Windows窗口与消息：钩子]]
- [[./posts/2020-07-01-Windows窗口与消息：窗口属性/index.html][2020-07-01-Windows窗口与消息：窗口属性]]
- [[./posts/2020-06-26-Windows窗口与消息：计时器/index.html][2020-06-26-Windows窗口与消息：计时器]]
- [[./posts/2020-06-25-Windows窗口与消息：消息与消息队列/index.html][2020-06-25-Windows窗口与消息：消息与消息队列]]
- [[./posts/2020-06-24-WIndows窗口与消息：窗口过程/index.html][2020-06-24-WIndows窗口与消息：窗口过程]]
- [[./posts/2020-06-22-Windows窗口与消息：窗口类/index.html][2020-06-22-Windows窗口与消息：窗口类]]
- [[./posts/2020-06-17-Windows的控制台和控制台应用/index.html][2020-06-17-Windows的控制台和控制台应用]]
- [[./posts/2020-06-15-写个C库-part5/index.html][2020-06-15-写个C库-part5]]
- [[./posts/2020-06-14-写个C库-part4/index.html][2020-06-14-写个C库-part4]]
- [[./posts/2020-06-03-写个C库-part3/index.html][2020-06-03-写个C库-part3]]
- [[./posts/2020-05-31-写个C库-part2/index.html][2020-05-31-写个C库-part2]]
- [[./posts/2020-05-18-写个C库-part1/index.html][2020-05-18-写个C库-part1]]
- [[./posts/2020-05-06-什么是base64编码/index.html][2020-05-06-什么是base64编码]]
- [[./posts/2020-04-15-有关动态链接库的知识/index.html][2020-04-15-有关动态链接库的知识]]
- [[./posts/2020-03-29-傅里叶级数与傅里叶变换/index.html][2020-03-29-傅里叶级数与傅里叶变换]]
- [[./posts/2020-03-19-常见线性常微分方程的解法/index.html][2020-03-19-常见线性常微分方程的解法]]
- [[./posts/2020-03-05-布尔函数的表示与化简/index.html][2020-03-05-布尔函数的表示与化简]]
- [[./posts/2020-03-02-C风格字符串缺陷及改进/index.html][2020-03-02-C风格字符串缺陷及改进]]
- [[./posts/2019-03-18-1div(chx)^n积分的一般形式/index.html][2019-03-18-1div(chx)^n积分的一般形式]]
#+end_raw
#+begin_raw

#+end_raw
